In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(":memory:")
cur = con.cursor()

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
link = 'https://raw.githubusercontent.com/eric-bunch/boston_housing/master/boston.csv'

In [4]:
data = pd.read_csv(link)
data.rename(columns = {'MDEV':'MEDV'}, inplace=True)

In [5]:
data.to_sql("boston", con, index=False, if_exists="replace")

In [6]:
pd.read_sql(
    """
    SELECT * FROM boston
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88,11.9

1. Выведите количество пустых значений по каждой из колонок (название колонки, кол-во пустых значений)

In [7]:
pd.read_sql(
    """
    SELECT sum(case when CRIM is null then 1 else 0 end) as CRIM,
           sum(case when ZN is null then 1 else 0 end) as ZN,
           sum(case when INDUS is null then 1 else 0 end) as INDUS,
           sum(case when CHAS is null then 1 else 0 end) as CHAS,
           sum(case when NOX is null then 1 else 0 end) as NOX,
           sum(case when RM is null then 1 else 0 end) as RM,
           sum(case when AGE is null then 1 else 0 end) as AGE,
           sum(case when DIS is null then 1 else 0 end) as DIS,
           sum(case when RAD is null then 1 else 0 end) as RAD,
           sum(case when TAX is null then 1 else 0 end) as TAX,
           sum(case when PTRATIO is null then 1 else 0 end) as PTRATIO,
           sum(case when B is null then 1 else 0 end) as B,
           sum(case when LSTAT is null then 1 else 0 end) as LSTAT,
           sum(case when MEDV is null then 1 else 0 end) as MEDV
    FROM boston
    """,
    con,
)

   CRIM  ZN  INDUS  CHAS  NOX  RM  AGE  DIS  RAD  TAX  PTRATIO  B  LSTAT  MEDV
0     0   0      0     0    0   0    0    0    0    0        0  0      0     0

2. Выведите количество уникальных значений по каждой из колонок (название колонки, кол-во уникальных значений)

In [8]:
pd.read_sql(
    """
    SELECT count(distinct CRIM) as CRIM,
           count(distinct ZN) as ZN,
           count(distinct INDUS) as INDUS,
           count(distinct CHAS) as CHAS, 
           count(distinct NOX) as NOX,
           count(distinct RM) as RM,
           count(distinct AGE) as AGE,
           count(distinct DIS) as DIS,
           count(distinct RAD) as RAD,
           count(distinct TAX) as TAX,
           count(distinct PTRATIO) as PTRATIO,
           count(distinct B) as B,
           count(distinct LSTAT)as LSTAT,
           count(distinct MEDV) as MEDV
    FROM boston
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,504,26,76,2,81,446,356,412,9,66,46,357,455,229

3. Выведите колонки, у которых медиана равна минимальному значению (название колонки).
Напишите какой вывод можно сделать по данным в этих колонках

In [9]:
pd.read_sql(
    """
    select Result
    from (
    with a as
    (SELECT min(CRIM) as min_CRIM,
           meadian_CRIM,
           min(ZN) as min_ZN,
           meadian_ZN,
           min(INDUS) as min_INDUS,
           meadian_INDUS,
           min(CHAS) as min_CHAS,
           meadian_CHAS,
           min(NOX) as min_NOX,
           meadian_NOX,
           min(RM) as min_RM,
           meadian_RM,
           min(AGE) as min_AGE,
           meadian_AGE,
           min(DIS) as min_DIS,
           meadian_DIS,
           min(RAD) as min_RAD,
           meadian_RAD,
           min(TAX) as min_TAX,
           meadian_TAX,
           min(PTRATIO) as min_PTRATIO,
           meadian_PTRATIO,
           min(B) as min_B,
           meadian_B,
           min(LSTAT) as min_LSTAT,
           meadian_LSTAT,
           min(MEDV) as min_MEDV,
           meadian_MEDV
    FROM boston,
    (SELECT CRIM as meadian_CRIM FROM boston order by CRIM LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT ZN as meadian_ZN FROM boston order by ZN LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT INDUS as meadian_INDUS FROM boston order by INDUS LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT CHAS as meadian_CHAS FROM boston order by CHAS LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT NOX as meadian_NOX FROM boston order by NOX LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT RM as meadian_RM FROM boston order by RM LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT AGE as meadian_AGE FROM boston order by AGE LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT DIS as meadian_DIS FROM boston order by DIS LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT RAD as meadian_RAD FROM boston order by RAD LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT TAX as meadian_TAX FROM boston order by TAX LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT PTRATIO as meadian_PTRATIO FROM boston order by PTRATIO LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT B as meadian_B FROM boston order by B LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT LSTAT as meadian_LSTAT FROM boston order by LSTAT LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2),
    (SELECT MEDV as meadian_MEDV FROM boston order by MEDV LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2))
    
    SELECT case when min_CRIM = meadian_CRIM then 'CRIM' else null end as Result FROM a
    union all
    SELECT case when min_ZN = meadian_ZN then 'ZN' else null end as Result FROM a
    union all
    SELECT case when min_INDUS = meadian_INDUS then 'INDUS' else null end as Result FROM a
    union all
    SELECT case when min_CHAS = meadian_CHAS then 'CHAS' else null end as Result FROM a
    union all
    SELECT case when min_NOX = meadian_NOX then 'NOX' else null end as Result FROM a
    union all
    SELECT case when min_RM = meadian_RM then 'RM' else null end as Result FROM a
    union all
    SELECT case when min_AGE = meadian_AGE then 'AGE' else null end as Result FROM a
    union all
    SELECT case when min_DIS = meadian_DIS then 'DIS' else null end as Result FROM a
    union all
    SELECT case when min_RAD = meadian_RAD then 'RAD' else null end as Result FROM a
    union all
    SELECT case when min_TAX = meadian_TAX then 'TAX' else null end as Result FROM a
    union all
    SELECT case when min_PTRATIO = meadian_PTRATIO then 'PTRATIO' else null end as Result FROM a
    union all
    SELECT case when min_B = meadian_B then 'B' else null end as Result FROM a
    union all
    SELECT case when min_LSTAT = meadian_LSTAT then 'LSTAT' else null end as Result FROM a
    union all
    SELECT case when min_MEDV = meadian_MEDV then 'MEDV' else null end as Result FROM a)
    where Result is not null
    """,
    con,
)

  Result
0     ZN
1   CHAS

Больше половины участком площадью меньше 25 000 кв. футов. и не граничат с рекой

4. Выведите разницу между среднем количеством комнат(RM) в домах с самой дорогой стоимостью(MEDV) и 25 самыми дешевыми домами. 
Аналогично по 50, 100, 200, 300 самыми дешевыми домами. (кол-во домов(25,50,100,200,300), среднее кол-во комнат в них, среднее кол-во комнат в самых дорогих, разница).
Напишите влияет ли кол-во комнат на стоимость и как сильно.

In [10]:
pd.read_sql(
    """
    SELECT
        count(RM) AS house_count,
        avg(RM) AS avg_rm,
        avg_rm_top,
        avg_rm_top- avg(RM) AS diff
    FROM
        (SELECT RM FROM boston ORDER BY medv LIMIT 25),
        (SELECT avg(rm) FILTER(WHERE medv = max(medv)) OVER() AS avg_rm_top FROM boston)
    union all
    SELECT
        count(RM) AS house_count,
        avg(RM) AS avg_rm,
        avg_rm_top,
        avg_rm_top- avg(RM) AS diff
    FROM
        (SELECT RM FROM boston ORDER BY medv LIMIT 50),
        (SELECT avg(rm) FILTER(WHERE medv = max(medv)) OVER() AS avg_rm_top FROM boston)
    union all
    SELECT
        count(RM) AS house_count,
        avg(RM) AS avg_rm,
        avg_rm_top,
        avg_rm_top- avg(RM) AS diff
    FROM
        (SELECT RM FROM boston ORDER BY medv LIMIT 100),
        (SELECT avg(rm) FILTER(WHERE medv = max(medv)) OVER() AS avg_rm_top FROM boston)
    union all
    SELECT
        count(RM) AS house_count,
        avg(RM) AS avg_rm,
        avg_rm_top,
        avg_rm_top- avg(RM) AS diff
    FROM
        (SELECT RM FROM boston ORDER BY medv LIMIT 200),
        (SELECT avg(rm) FILTER(WHERE medv = max(medv)) OVER() AS avg_rm_top FROM boston)
    union all
    SELECT
        count(RM) AS house_count,
        avg(RM) AS avg_rm,
        avg_rm_top,
        avg_rm_top- avg(RM) AS diff
    FROM
        (SELECT RM FROM boston ORDER BY medv LIMIT 300),
        (SELECT avg(rm) FILTER(WHERE medv = max(medv)) OVER() AS avg_rm_top FROM boston)
    """,
    con,
)

   house_count    avg_rm  avg_rm_top      diff
0           25  5.747840       7.489  1.741160
1           50  5.753240       7.489  1.735760
2          100  5.887120       7.489  1.601880
3          200  5.911705       7.489  1.577295
4          300  5.972227       7.489  1.516773

5. Выведите ранги значений колонки LSTAT(процент населения с более низким статусом) в домах с самой дорогой стоимостью (значение LSTAT, стоимость, ранг). Напишите какой вывод можно сделать по этим данным.

In [11]:
pd.read_sql(
    """
    SELECT lstat, medv, dense_rank() OVER (PARTITION BY lstat ORDER BY medv DESC) rank_by_lstat
    FROM boston
    """,
    con,
)

     LSTAT  MEDV  rank_by_lstat
0     1.73  50.0              1
1     1.92  50.0              1
2     1.98  34.9              1
3     2.47  41.7              1
4     2.87  36.4              1
..     ...   ...            ...
501  34.37  17.9              1
502  34.41  14.4              1
503  34.77  13.8              1
504  36.98   7.0              1
505  37.97  13.8              1

[506 rows x 3 columns]

6. Выведите среднюю стоимость домов граничащих с рекой(CHAS) и нет (граничит/не граничит, стоимость)

In [12]:
pd.read_sql(
    """
    SELECT
        DISTINCT *
    FROM
        (SELECT avg(MEDV) OVER (PARTITION BY CHAS) AS 'avg_by_chas', CHAS FROM boston)
    """,
    con,
)

   avg_by_chas  CHAS
0    22.093843   0.0
1    28.440000   1.0

7. Выведите все колонки, у которых среднее значение выше, когда дом граничит с рекой (название колонки). Напишите какой вывод можно сделать по этим данным.

In [13]:
pd.read_sql(
    """
    select Result
    from (
    SELECT 
    case when avg(CRIM) filter(where chas = 1.0) > avg(CRIM) filter(where chas = 0.0) then 'CRIM' else null end as Result
    FROM boston
    union all
    SELECT
    case when avg(ZN) filter(where chas = 1.0) > avg(ZN) filter(where chas = 0.0) then 'ZN' else null end as Result
    FROM boston
    union all 
    SELECT 
    case when avg(INDUS) filter(where chas = 1.0) > avg(INDUS) filter(where chas = 0.0) then 'INDUS' else null end as Result
    FROM boston
    union all
    SELECT 
    case when avg(CHAS) filter(where chas = 1.0) > avg(CHAS) filter(where chas = 0.0) then 'CHAS' end as Result
    FROM boston
    union all
    SELECT 
    case when avg(NOX) filter(where chas = 1.0) > avg(NOX) filter(where chas = 0.0) then 'NOX' end as Result
    FROM boston
    union all
    SELECT 
    case when avg(RM) filter(where chas = 1.0) > avg(RM) filter(where chas = 0.0) then 'RM' end as Result
    FROM boston
    union all    
    SELECT 
    case when avg(AGE) filter(where chas = 1.0) > avg(AGE) filter(where chas = 0.0) then 'AGE' end as Result
    FROM boston
    union all     
    SELECT 
    case when avg(DIS) filter(where chas = 1.0) > avg(DIS) filter(where chas = 0.0) then 'DIS' end as Result
    FROM boston
    union all      
    SELECT 
    case when avg(RAD) filter(where chas = 1.0) > avg(RAD) filter(where chas = 0.0) then 'RAD' end as Result
    FROM boston
    union all   
    SELECT 
    case when avg(TAX) filter(where chas = 1.0) > avg(TAX) filter(where chas = 0.0) then 'TAX' end as Result
    FROM boston
    union all   
    SELECT 
    case when avg(PTRATIO) filter(where chas = 1.0) > avg(PTRATIO) filter(where chas = 0.0) then 'PTRATIO' end as Result
    FROM boston
    union all 
    SELECT 
    case when avg(B) filter(where chas = 1.0) > avg(B) filter(where chas = 0.0) then 'B' end as Result
    FROM boston
    union all 
    SELECT 
    case when avg(LSTAT) filter(where chas = 1.0) > avg(LSTAT) filter(where chas = 0.0) then 'LSTAT' end as Result
    FROM boston
    union all
    SELECT
    case when avg(MEDV) filter(where chas = 1.0) > avg(MEDV) filter(where chas = 0.0) then 'MEDV' else null end as Result
    FROM boston)
    where Result is not null
    """,
    con,
)

  Result
0  INDUS
1   CHAS
2    NOX
3     RM
4    AGE
5      B
6   MEDV

Дома у реки старше и дороже

8. Выведите значения долей промышленной застройки(INDUS), концентрации оксидов азота(NOX) и по их перцентилям - 10, 20 ... 100 ( перцетиль(10,20...100),значение INDUS, значение NOX). Напишите прослеживается между ними взаимосвязь

In [14]:
pd.read_sql(
    """
    SELECT (NTILE(10) OVER(ORDER BY INDUS, NOX)) * 10 AS 'NTILE', INDUS, NOX
    FROM boston
    """,
    con,
)

     NTILE  INDUS    NOX
0       10   0.46  0.422
1       10   0.74  0.410
2       10   1.21  0.401
3       10   1.22  0.403
4       10   1.25  0.429
..     ...    ...    ...
501    100  27.74  0.609
502    100  27.74  0.609
503    100  27.74  0.609
504    100  27.74  0.609
505    100  27.74  0.609

[506 rows x 3 columns]

При меньшем кооэффициенте промышленной застройки концентрация оксидов азота меньше.

CRIM - уровень преступности на душу населения
ZN - доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов.
INDUS - доля акров неторгового бизнеса на город.
CHAS - 1, если граничит с рекой, 0 иначе
NOX - концентрация оксидов азота (частей на 10 миллионов)
RM - среднее количество комнат в квартире
AGE - доля жилых домов, построенных до 1940 г.
DIS - взвешенные расстояния до пяти центров занятости Бостона
RAD - индекс доступности к радиальным магистралям
TAX - полная ставка налога на имущество за 10 000 долларов США
PTRATIO - соотношение учеников и учителей по городам
B - 1000(Bk - 0.63)^2, где Bk доля чернокожих людей по городам
LSTAT - % более низкого статуса населения
MEDV - Средняя стоимость домов в 1000 долларов.